import asyncio
from sqlalchemy import select
from app.database.core import async_session_maker
from app.database.models import Category

# Список категорий из твоего ТЗ
CATEGORIES_DATA = [
    # 🔹 Основные категории
    "Стаканы", "Тарелки", "Контейнеры для еды", "Столовые приборы", "Крышки", "Салфетки и бумажные изделия",
    # 🔹 Пакеты и упаковка
    "Крафт-пакеты", "Пакеты с ручками", "Пакеты без ручек", "Упаковка для доставки",
    # 🔹 По материалу
    "Бумажная посуда", "Пластиковая посуда", "Экологичная посуда (крафт, био)", "Алюминиевая посуда",
    # 🔹 Для бизнеса
    "Для кафе и ресторанов (HoReCa)", "Для доставки еды", "Для мероприятий и кейтеринга",
    # 🔹 Дополнительно
    "Наборы", "Новинки", "Акции и скидки"
]

async def init_cats():
    async with async_session_maker() as session:
        print("⏳ Проверка категорий...")
        
        for cat_name in CATEGORIES_DATA:
            stmt = select(Category.id).where(Category.name_ru == cat_name).limit(1)
            result = await session.execute(stmt)
            if result.scalar_one_or_none():
                continue
            # Создаем новую
            # Пока ставим name_uz таким же, как name_ru (потом изменишь)
            new_cat = Category(name_ru=cat_name, name_uz=cat_name)
            session.add(new_cat)
            print(f"➕ Добавлена категория: {cat_name}")
        
        await session.commit()
        print("🏁 Готово!")

if __name__ == "__main__":
    asyncio.run(init_cats())
