import asyncio
from sqlalchemy import insert
from app.database.core import async_session_maker
from app.database.models import Category

# Список категорий из твоего ТЗ
CATEGORIES_DATA = [
    # 🔹 Основные категории
    "Стаканы", "Тарелки", "Контейнеры для еды", "Столовые приборы", "Крышки", "Салфетки и бумажные изделия",
    # 🔹 Пакеты и упаковка
    "Крафт-пакеты", "Пакеты с ручками", "Пакеты без ручек", "Упаковка для доставки",
    # 🔹 По материалу
    "Бумажная посуда", "Пластиковая посуда", "Экологичная посуда (крафт, био)", "Алюминиевая посуда",
    # 🔹 Для бизнеса
    "Для кафе и ресторанов (HoReCa)", "Для доставки еды", "Для мероприятий и кейтеринга",
    # 🔹 Дополнительно
    "Наборы", "Новинки", "Акции и скидки"
]

async def init_cats():
    async with async_session_maker() as session:
        print("⏳ Проверка категорий...")
        
        for cat_name in CATEGORIES_DATA:
            stmt = (
                insert(Category)
                .values(name_ru=cat_name, name_uz=cat_name)
                .on_conflict_do_nothing(index_elements=[Category.name_ru])
            )
            result = await session.execute(stmt)
            if result.rowcount:
                print(f"➕ Добавлена категория: {cat_name}")
        
        await session.commit()
        print("🏁 Готово!")

if __name__ == "__main__":
    asyncio.run(init_cats())
